{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"урок по cpython.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Введение в Python и CPython\n",
    "\n",
    "1. Что такое CPython и чем он отличается от Python?\n",
    "Cpython - интерпритатор, а Python - язык программирования\n",
    "\n",
    "3. Сколько существует реализаций Python, и какая из них самая популярная?\n",
    "На сегодня существует более 10 реализаций Python, Cpython - самая популярная\n",
    "\n",
    "4. На каком языке написан CPython?\n",
    "С + Python\n",
    "\n",
    "#### Поиск и установка CPython\n",
    "\n",
    "5. (опционально) Кто создал CPython?\n",
    "CPython создал Гвидо ван Россум (Guido van Rossum) — нидерландский программист, разработавший сам язык Python и его первую реализацию (CPython).\n",
    "\n",
    "6. Почему Python считается быстрым, несмотря на то, что это интерпретируемый язык?\n",
    "т к С быстрый язык программирования\n",
    "\n",
    "7. Напишите путь к Интерпретатору CPython на вашем компьютере\n",
    "C:\\Users\\cherk\\AppData\\Local\\Programs\\Python\\Python310\\python.exe\n",
    "\n",
    "#### Структура CPython\n",
    "\n",
    "8. Что содержится в папке include в CPython?\n",
    "Папка include в CPython содержит заголовочные файлы (.h), необходимые для работы с Python на уровне C. Эти файлы используются:\n",
    "Для компиляции C-расширений (например, модулей типа numpy).\n",
    "Для встраивания Python в другие приложения (например, C/C++ программы).\n",
    "\n",
    "9. Где можно найти исходный код CPython дайте ссылку на репозиторий гитхаб\n",
    "https://github.com/python/cpython\n",
    "\n",
    "10. (опционально) Как работает интерпретатор CPython при выполнении кода?\n",
    "\n",
    "Построчное считывание кода\n",
    "Парсинг (разбор синтаксиса)\n",
    "Компиляция в байт-кода\n",
    "Исполнение байт-кода\n",
    "Работа с объектами\n",
    "\n",
    "\n",
    "#### Запуск файла с помощью CPython\n",
    "\n",
    "11. Какая команда используется для запуска файла с помощью CPython?\n",
    "\n",
    "python файл.py\n",
    "\n",
    "12. Можно ли запускать текстовые файлы через интерпретатор Python? Почему?\n",
    "\n",
    "можно\n",
    "Почему это работает:\n",
    "Python — это интерпретируемый язык, поэтому он анализирует смысл команд, а не расширение файла.\n",
    "Если содержимое можно разобрать как Python-код (даже в .txt), он выполнится.\n",
    "Для не-Python-файлов нужны специальные методы (парсеры JSON, CSV и т.д.).\n",
    "\n",
    "13. Как указать путь к интерпретатору и файлу для выполнения кода?\n",
    "находим в проводнике папку, где лежит python.exe и файл с кодом\n",
    "\n",
    "### Введение в PyPy\n",
    "\n",
    "14. Чем PyPy отличается от CPython?\n",
    "\n",
    "Cpython - интерпритатор, а Python - язык программирования\n",
    "\n",
    "15. Почему PyPy не может использоваться для всех проектов на Python?\n",
    "\n",
    "Многие популярные библиотеки (numpy, pandas, tensorflow) используют нативные C-модули, которые оптимизированы под CPython. PyPy не всегда корректно работает с ними из-за различий в API.\n",
    "\n",
    "16. Где можно скачать PyPy?\n",
    "\n",
    "pypy.org\n",
    "\n",
    "\n",
    "#### Установка и запуск PyPy\n",
    "\n",
    "17. Как установить PyPy после скачивания?\n",
    "\n",
    "разархивировать зипку и найти pypy.exe\n",
    "\n",
    "18. Как запустить файл с помощью PyPy?\n",
    "\n",
    "pypy3 ваш_файл.py\n",
    "\n",
    "19. Почему PyPy выполняет код быстрее, чем CPython?\n",
    "\n",
    "PyPy ускоряет выполнение Python-кода благодаря JIT-компиляции (Just-In-Time) и оптимизациям на лету. Вот ключевые причины его преимущества в скорости\n",
    "\n",
    "### Практические задания\n",
    "#### Задание 1: Поиск и установка CPython\n",
    "\n",
    "Проверьте, установлен ли CPython на вашем компьютере:\n",
    "    Используйте поиск в меню \"Пуск\" (Windows) или терминале (Linux/Mac).\n",
    "    Введите команду python --version или python3 --version в терминале.\n",
    "Если CPython не установлен, скачайте его с официального сайта Python https://www.python.org/downloads/ и установите.\n",
    "\n",
    "#### Задание 2: Исследование структуры CPython\n",
    "\n",
    "Найдите папку, где установлен Python (например, через команду which python в терминале или свойства ярлыка).\n",
    "Откройте папку include и изучите её содержимое. Какое количество файлов на C там есть? 82\n",
    "Перейдите на [GitHub-репозиторий CPython](https://github.com/python/cpython) и найдите файл README. Прочитайте информацию о проекте.\n",
    "\n",
    "#### Задание 3: Запуск файла с помощью CPython\n",
    "\n",
    "Создайте текстовый файл example.txt с содержимым:\n",
    "print(\"Hello from CPython!\")\n",
    "\n",
    "Запустите файл через команду python <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "Проверьте, что выводится на экран. Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "#### Задание 4: Установка и использование PyPy\n",
    "\n",
    "Перейдите на [официальный сайт PyPy](https://www.pypy.org/) и скачайте подходящую версию для вашей операционной системы.\n",
    "Распакуйте скачанный архив в удобное место.\n",
    "Создайте файл example_pypy.py с кодом:\n",
    "print(\"Hello from pypy!\")\n",
    "\n",
    "Запустите файл через PyPy\n",
    "pypy <путь_до_файла> (замените <путь_до_файла> на фактический путь к вашему файлу).\n",
    "Проверьте, что выводится на экран. Попробуйте изменить расширение файла на .py и повторите запуск.\n",
    "\n",
    "#### Задание 5: Сравнение производительности CPython и PyPy\n",
    "\n",
    "Создайте файл performance_test.py с кодом:\n",
    "    import time\n",
    "    start_time = time.time()\n",
    "    total = 0\n",
    "    for i in range(1, 10000000):\n",
    "        total += i\n",
    "    end_time = time.time()\n",
    "    \n",
    "    print(\"Result:\", total)\n",
    "    print(\"Execution time:\", end_time - start_time, \"seconds\")\n",
    "Запустите этот файл сначала через CPython, а затем через PyPy. Запишите результаты времени выполнения для обоих интерпретаторов.\n",
    "Сделайте вывод о разнице в производительности\n",
    "\n",
    "запуск с помощью pypy: Result: 49999995000000\n",
    "Execution time: 0.025283098220825195 seconds\n",
    "\n",
    "запуск с помощью Cpython: Result: 49999995000000\n",
    "Execution time: 0.6745193004608154 seconds\n",
    "\n",
    "PyPy быстрее Cpython"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
